{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 128, 128, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block1_conv1", "trainable": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block1_conv2", "trainable": false}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block2_conv1", "trainable": false}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block2_conv2", "trainable": false}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block3_conv1", "trainable": false}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block3_conv2", "trainable": false}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "block3_conv3", "trainable": false}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [2, 2], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_10", "trainable": false}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [2, 2], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_11", "trainable": false}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [2, 2], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_12", "trainable": false}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [4, 4], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_16", "trainable": false}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [4, 4], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_17", "trainable": false}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [4, 4], "filters": 512, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_18", "trainable": false}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_19", "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "bias_regularizer": null, "name": "conv2d_1", "trainable": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_4", "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_7", "trainable": true}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_13", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "AlphaDropout", "name": "alpha_dropout_1", "config": {"rate": 0.5, "name": "alpha_dropout_1", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_5", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_8", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_14", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"activation": "sigmoid", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_20", "trainable": true}, "inbound_nodes": [[["alpha_dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_6", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_9", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"activation": "relu", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_15", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "AlphaDropout", "name": "alpha_dropout_2", "config": {"rate": 0.5, "name": "alpha_dropout_2", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_6", 0, 0, {}], ["conv2d_9", 0, 0, {}], ["conv2d_15", 0, 0, {}], ["alpha_dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"activation": "sigmoid", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 1, "data_format": "channels_last", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_21", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "output_layers": [["conv2d_21", 0, 0]], "name": "model_1"}, "keras_version": "2.0.8"}