{"config": {"layers": [{"config": {"name": "input_1", "batch_input_shape": [null, 256, 256, 3], "sparse": false, "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"activation": "relu", "name": "block1_conv1", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block1_conv2", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"trainable": false, "name": "block1_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block2_conv1", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block2_conv2", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"trainable": false, "name": "block2_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block3_conv1", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block3_conv2", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "block3_conv3", "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_10", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [2, 2], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_11", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [2, 2], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_12", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [2, 2], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_16", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [4, 4], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_17", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [4, 4], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_18", "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [4, 4], "kernel_size": [3, 3], "trainable": false, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_19", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_1", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_4", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_7", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_13", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "alpha_dropout_1", "rate": 0.5}, "name": "alpha_dropout_1", "class_name": "AlphaDropout", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_2", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_5", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_8", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_14", "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "name": "conv2d_20", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["alpha_dropout_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_3", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_6", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_9", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "conv2d_15", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "alpha_dropout_2", "rate": 0.5}, "name": "alpha_dropout_2", "class_name": "AlphaDropout", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_6", 0, 0, {}], ["conv2d_9", 0, 0, {}], ["conv2d_15", 0, 0, {}], ["alpha_dropout_2", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "name": "conv2d_21", "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}, "name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_21", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.8"}