{"class_name": "Model", "keras_version": "2.1.0", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["softmax", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block1_conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block1_conv2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "data_format": "channels_last", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block2_conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block2_conv2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "data_format": "channels_last", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 256, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 256, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block3_conv3", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 256, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block3_pool", "data_format": "channels_last", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block4_conv3", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block4_pool", "data_format": "channels_last", "trainable": false}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "block5_conv3", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 512, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "trainable": false}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_1", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_5_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv_scale_5_1"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_5_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_5_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv_scale_5_2"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_5_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_2", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_3", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "name": "concatenate_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_4_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv_scale_4_1"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_4_1", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_4_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 128, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv_scale_4_2"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_4_2", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_4", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_5", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2"}, "class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "name": "concatenate_2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_3_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv_scale_3_1"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_3_1", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_3_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv_scale_3_2"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_3_2", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_6", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_7", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_3"}, "class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["up_sampling2d_3", 0, 0, {}]]], "name": "concatenate_3"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_2_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv_scale_2_1"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_2_1", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_2_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 64, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv_scale_2_2"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_8"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_2_2", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_8", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "name": "batch_normalization_9", "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_4"}, "class_name": "UpSampling2D", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "up_sampling2d_4"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_4"}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]], "name": "concatenate_4"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_1_1", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 32, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv_scale_1_1"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_9"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_1_1", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "conv_scale_1_2", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 32, "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv_scale_1_2"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_10"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv_scale_1_2", 0, 0, {}]]], "name": "leaky_re_lu_10"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "softmax", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "distribution": "uniform", "scale": 2.0}}, "filters": 6, "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "softmax", "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "softmax"}], "name": "model_1"}, "backend": "tensorflow"}